YangQwQ/Stm32VisionSenseCar/Stm32-Vision/app_httpd.cpp
// Copyright 2015-2016 Espressif Systems (Shanghai) PTE LTD
//
// Licensed under the Apache License, Version 2.0 (the "License");
// you may not use this file except in compliance with the License.
// You may obtain a copy of the License at
//
//     http://www.apache.org/licenses/LICENSE-2.0
//
// Unless required by applicable law or agreed to in writing, software
// distributed under the License is distributed on an "AS IS" BASIS,
// WITHOUT WARRANTIES OR CONDITIONS OF ANY KIND, either express or implied.
// See the License for the specific language governing permissions and
// limitations under the License.
#include "esp_http_server.h"
#include "esp_timer.h"
#include "esp_camera.h"
#include "img_converters.h"
#include "fb_gfx.h"
#include "esp32-hal-ledc.h"
#include "sdkconfig.h"
#include "camera_index.h"

#if defined(ARDUINO_ARCH_ESP32) && defined(CONFIG_ARDUHAL_ESP_LOG)
#include "esp32-hal-log.h"
#endif

// 板载人脸检测/识别已关闭：其依赖 Espressif esp-face 的模型头文件，
// 且本项目视觉识别交由云端多模态大模型完成，板载人脸检测非必需。
// 若日后需要启用：引入 espressif/esp-face 模型头文件后，将下面两宏置 1 即可。
#define CONFIG_ESP_FACE_DETECT_ENABLED 0
#define CONFIG_ESP_FACE_RECOGNITION_ENABLED 0

#if CONFIG_ESP_FACE_DETECT_ENABLED

#include <vector>
#include "human_face_detect_msr01.hpp"
#include "human_face_detect_mnp01.hpp"

#define TWO_STAGE 1 /*<! 1: detect by two-stage which is more accurate but slower(with keypoints). */
                    /*<! 0: detect by one-stage which is less accurate but faster(without keypoints). */

#if CONFIG_ESP_FACE_RECOGNITION_ENABLED
#include "face_recognition_tool.hpp"
#include "face_recognition_112_v1_s16.hpp"
#include "face_recognition_112_v1_s8.hpp"

#define QUANT_TYPE 0 //if set to 1 => very large firmware, very slow, reboots when streaming...

#define FACE_ID_SAVE_NUMBER 7
#endif

#define FACE_COLOR_WHITE 0x00FFFFFF
#define FACE_COLOR_BLACK 0x00000000
#define FACE_COLOR_RED 0x000000FF
#define FACE_COLOR_GREEN 0x0000FF00
#define FACE_COLOR_BLUE 0x00FF0000
#define FACE_COLOR_YELLOW (FACE_COLOR_RED | FACE_COLOR_GREEN)
#define FACE_COLOR_CYAN (FACE_COLOR_BLUE | FACE_COLOR_GREEN)
#define FACE_COLOR_PURPLE (FACE_COLOR_BLUE | FACE_COLOR_RED)
#endif

// Enable LED FLASH setting
#define CONFIG_LED_ILLUMINATOR_ENABLED 1

// LED FLASH setup
#if CONFIG_LED_ILLUMINATOR_ENABLED

#define CONFIG_LED_MAX_INTENSITY 255

int led_duty = 0;
bool isStreaming = false;
static uint8_t s_led_pin = 0;  // core 3.x LEDC 改引脚式 API，不再手动分 channel（与摄像头 timer 冲突由驱动内部处理）

#endif

typedef struct
{
    httpd_req_t *req;
    size_t len;
} jpg_chunking_t;

#define PART_BOUNDARY "123456789000000000000987654321"
static const char *_STREAM_CONTENT_TYPE = "multipart/x-mixed-replace;boundary=" PART_BOUNDARY;
static const char *_STREAM_BOUNDARY = "\r\n--" PART_BOUNDARY "\r\n";
static const char *_STREAM_PART = "Content-Type: image/jpeg\r\nContent-Length: %u\r\nX-Timestamp: %d.%06d\r\n\r\n";

httpd_handle_t stream_httpd = NULL;
httpd_handle_t camera_httpd = NULL;

#ifdef CONFIG_HTTPD_WS_SUPPORT
// =================== WebSocket（端口 81 根路径，手机 App WSCarClient 通道） ===================
#include "ArduinoJson.h"
#include "camera.h"
#include "command.h"
#include "ble.h"
#include "ai_client.h"
#include "uart.h"

#define WS_STREAM_FPS 10
#define WS_EDIT_IMG_MAX (128 * 1024)  // 编辑图（二进制上行）上限，与 ai_client 一致

// WS 对端（手机）活体探测：连续此时间无任何上行 → 发一次探测 ping；再此时间无响应判死。
// 用于感知"静默断链"（如手机重启），恢复 BLE 广播供再次配网/兜底。探测基于应用层
// {"type":"ping"}，对端协议栈/客户端回 {"type":"pong"}，均走 WS 文本帧，无附加心跳.
static const uint32_t WS_IDLE_PING_MS = 30000;    // 连续无上行时长，达到则发探测
static const uint32_t WS_PING_TIMEOUT_MS = 3000;  // 探测后可容忍的无上行时长（判死界）
static volatile uint32_t s_ws_last_rx_ms = 0;      // 最近收到任一 WS 文本/binary 上行（ms）
static volatile bool s_ws_ping_pending = false;    // 已发探测、等 pong（由 httpd 任务写入）
static uint32_t s_ws_ping_at_ms = 0;

// httpd 活跃 fd 表上限，须 >= 服务器 max_open_sockets（给足余量，过长时跳过）
#define WS_MAX_CLIENTS 32

// 全量 WS fd 探测/踢除辅助：httpd 仅暴露活跃 fd 表，无 per-fd 状态管理，故按需遍历。
static esp_err_t ws_send_text(int fd, const char *text);  // 前向声明（定义在下方）
static void ws_ping_all(void) {
    int fds[WS_MAX_CLIENTS]; size_t n = WS_MAX_CLIENTS;
    if (httpd_get_client_list(stream_httpd, &n, fds) != ESP_OK) return;
    for (size_t i = 0; i < n; i++) {
        if (httpd_ws_get_fd_info(stream_httpd, fds[i]) != HTTPD_WS_CLIENT_WEBSOCKET) continue;
        ws_send_text(fds[i], "{\"type\":\"ping\"}");  // 探测帧，对端回 pong
    }
}

static void ws_kick_all(void) {
    int fds[WS_MAX_CLIENTS]; size_t n = WS_MAX_CLIENTS;
    if (httpd_get_client_list(stream_httpd, &n, fds) != ESP_OK) return;
    for (size_t i = 0; i < n; i++) {
        if (httpd_ws_get_fd_info(stream_httpd, fds[i]) != HTTPD_WS_CLIENT_WEBSOCKET) continue;
        httpd_sess_trigger_close(stream_httpd, fds[i]);  // 关闭死 fd，下轮剔出 client list
    }
}

static esp_err_t ws_send_text(int fd, const char *text)
{
    httpd_ws_frame_t frame = {0};
    frame.type = HTTPD_WS_TYPE_TEXT;
    frame.payload = (uint8_t *)text;
    frame.len = strlen(text);
    return httpd_ws_send_frame_async(stream_httpd, fd, &frame);
}

static esp_err_t ws_send_jpeg(int fd, camera_fb_t *fb)
{
    httpd_ws_frame_t frame = {0};
    frame.type = HTTPD_WS_TYPE_BINARY;
    frame.payload = fb->buf;
    frame.len = fb->len;
    return httpd_ws_send_frame_async(stream_httpd, fd, &frame);
}

// cmd::Reply 适配：把应答文本发回给指定 fd
static void ws_cmd_reply(void *ctx, const char *text)
{
    int fd = *(int *)ctx;
    ws_send_text(fd, text);
}

// 文本帧 = 指令 JSON；snapshot/ping 就地处理，其余类型统一移交 command 模块
static void ws_handle_text(const char *json, int fd)
{
    JsonDocument doc;
    if (deserializeJson(doc, json)) {
        log_w("[ws] bad json: %s", json);
        return;
    }
    const char *type = doc["type"] | "";

    if (!strcmp(type, "snapshot")) {
        camera_fb_t *fb = cam::grab();
        if (fb) {
            ws_send_jpeg(fd, fb);
            cam::return_frame(fb);
        }
    } else if (!strcmp(type, "ping")) {
        // 连通性测试：回 pong（手动 /ping 触发，无周期心跳）。
        ws_send_text(fd, "{\"type\":\"pong\"}");
    } else {
        // 统一词表：move/stop/arm/config/stream/ai_goal/ai_cancel 等交给 command
        // （stream 由 command 更新全局图传开关；ai_goal 异步结果回传）。
        // 摇杆高频帧同指令连续重复时只记首条，避免刷屏；换指令再记。
        static String s_last_cmd;
        if (s_last_cmd != type) {
          log_i("[ws] forward to cmd: %s", type);
          s_last_cmd = type;
        }
        cmd::handle(json, true, ws_cmd_reply, &fd);
    }
}

static esp_err_t ws_handler(httpd_req_t *req)
{
    if (req->method == HTTP_GET) {
        // 非 WS 升级的浏览器访问根路径 → 重定向到 /stream
        if (httpd_req_get_hdr_value_len(req, "Upgrade") == 0) {
            httpd_resp_set_status(req, "302 Found");
            httpd_resp_set_hdr(req, "Location", "/stream");
            httpd_resp_send(req, NULL, 0);
            return ESP_OK;
        }
        return ESP_OK; // WS 握手，101 由 httpd 自动完成
    }

