YangQwQ/Stm32VisionSenseCar/Stm32-Vision/app_httpd.cpp
    httpd_ws_frame_t pkt = {0};
    pkt.type = HTTPD_WS_TYPE_TEXT;
    esp_err_t ret = httpd_ws_recv_frame(req, &pkt, 0);
    if (ret != ESP_OK) return ret;
    if (pkt.len == 0) return ESP_OK;
    s_ws_last_rx_ms = (uint32_t)(esp_timer_get_time() / 1000);  // 任何上行都视为有活动，续活判定准
    s_ws_ping_pending = false;                                   // 收到上行即撤销探测等待，防误杀

    // 二进制帧 = 编辑图（裸 JPEG，手机→板）：覆盖暂存供 ai_goal{use_image}消费。
    if (pkt.type == HTTPD_WS_TYPE_BINARY) {
        if (pkt.len > WS_EDIT_IMG_MAX) return ESP_FAIL;  // 超大帧，断开
        char *ibuf = (char *)malloc(pkt.len);
        if (!ibuf) return ESP_ERR_NO_MEM;
        pkt.payload = (uint8_t *)ibuf;
        ret = httpd_ws_recv_frame(req, &pkt, pkt.len);
        if (ret == ESP_OK && pkt.type == HTTPD_WS_TYPE_BINARY) {
            ai::set_edited_image((uint8_t *)ibuf, pkt.len);
        }
        free(ibuf);
        return ret;
    }

    // 文本帧 = 指令 JSON（≤512B，异常长帧断开）
    if (pkt.len > 512) return ESP_FAIL;
    char *buf = (char *)malloc(pkt.len + 1);
    if (!buf) return ESP_ERR_NO_MEM;
    pkt.payload = (uint8_t *)buf;
    ret = httpd_ws_recv_frame(req, &pkt, pkt.len);
    if (ret == ESP_OK && pkt.type == HTTPD_WS_TYPE_TEXT) {
        buf[pkt.len] = 0;
        ws_handle_text(buf, httpd_req_to_sockfd(req));
    }
    free(buf);
    return ret;
}

// core 3.x / IDF 无 httpd_ws_client_iterate：改由 httpd_get_client_list 取全部活跃
// fd，再用 httpd_ws_get_fd_info 筛出 WEBSOCKET 会话（HTTP 会话不计入）。

static bool ws_send_jpeg_to_ws_clients(camera_fb_t *fb, bool *has_client)
{
    bool any = false;
    int fds[WS_MAX_CLIENTS];
    size_t n = WS_MAX_CLIENTS;
    if (httpd_get_client_list(stream_httpd, &n, fds) != ESP_OK) return false;
    for (size_t i = 0; i < n; i++) {
        if (httpd_ws_get_fd_info(stream_httpd, fds[i]) != HTTPD_WS_CLIENT_WEBSOCKET) continue;
        any = true;
        if (has_client) *has_client = true;
        if (fb) ws_send_jpeg(fds[i], fb);
    }
    return any;
}

// 执行板日志镜像回调：把一帧文本广播给全部 WS 客户端（uart::update 主循环上下文，async 安全）。
static void ws_send_text_to_ws_clients(const char *text)
{
    int fds[WS_MAX_CLIENTS];
    size_t n = WS_MAX_CLIENTS;
    if (httpd_get_client_list(stream_httpd, &n, fds) != ESP_OK) return;
    for (size_t i = 0; i < n; i++) {
        if (httpd_ws_get_fd_info(stream_httpd, fds[i]) != HTTPD_WS_CLIENT_WEBSOCKET) continue;
        ws_send_text(fds[i], text);
    }
}

// 图传推流任务：stream 开启时按帧率向所有 WS 客户端推 JPEG 帧；
// 同时探测 WS 客户端存在性喂给 ble::set_ws_connected（status.ws），并做对端活体探测：
// 连续 WS_IDLE_PING_MS 无上行 → 发探测 ping；再 WS_PING_TIMEOUT_MS 无任意上行 → 判死，
// 踢掉全部 WS fd 并恢复 BLE 广播（供再次配网/兜底）。assume 单手机客户端（全局 last_rx）。
static void ws_stream_task(void *arg)
{
    while (true) {
        bool has_client = false;
        if (cmd::streaming()) {
            camera_fb_t *fb = cam::grab();
            if (fb) {
                ws_send_jpeg_to_ws_clients(fb, &has_client);
                cam::return_frame(fb);
            }
        } else {
            ws_send_jpeg_to_ws_clients(nullptr, &has_client);  // 探测挂着的 WS 客户端
        }

        uint32_t now = (uint32_t)(esp_timer_get_time() / 1000);
        if (has_client) {
            if (s_ws_last_rx_ms == 0) s_ws_last_rx_ms = now;  // 首个挂上的时刻作为 idle 起点
            if (!s_ws_ping_pending && (int32_t)(now - s_ws_last_rx_ms) >= (int32_t)WS_IDLE_PING_MS) {
                s_ws_ping_pending = true;
                s_ws_ping_at_ms = now;
                ws_ping_all();
                Serial.println("[ws] idle 超时，发探测 ping");
            } else if (s_ws_ping_pending &&
                       (int32_t)(now - s_ws_ping_at_ms) >= (int32_t)WS_PING_TIMEOUT_MS) {
                // 探测后仍无上行 → 判死：踢 fd，下轮 has_client 回落 → 尾部恢复广播
                s_ws_ping_pending = false;
                s_ws_last_rx_ms = 0;
                has_client = false;
                ws_kick_all();
                Serial.println("[ws] 探测超时，判定断线，恢复广播");
            }
        } else {
            s_ws_ping_pending = false;  // 无 WS 挂载时复位探测态
        }

        ble::set_ws_connected(has_client);
        vTaskDelay(pdMS_TO_TICKS(1000 / WS_STREAM_FPS));
    }
}
#endif // CONFIG_HTTPD_WS_SUPPORT

#if CONFIG_ESP_FACE_DETECT_ENABLED

static int8_t detection_enabled = 0;

// #if TWO_STAGE
// static HumanFaceDetectMSR01 s1(0.1F, 0.5F, 10, 0.2F);
// static HumanFaceDetectMNP01 s2(0.5F, 0.3F, 5);
// #else
// static HumanFaceDetectMSR01 s1(0.3F, 0.5F, 10, 0.2F);
// #endif

#if CONFIG_ESP_FACE_RECOGNITION_ENABLED
static int8_t recognition_enabled = 0;
static int8_t is_enrolling = 0;

#if QUANT_TYPE
    // S16 model
    FaceRecognition112V1S16 recognizer;
#else
    // S8 model
    FaceRecognition112V1S8 recognizer;
#endif
#endif

#endif

typedef struct
{
    size_t size;  //number of values used for filtering
    size_t index; //current value index
    size_t count; //value count
    int sum;
    int *values; //array to be filled with values
} ra_filter_t;

static ra_filter_t ra_filter;

static ra_filter_t *ra_filter_init(ra_filter_t *filter, size_t sample_size)
{
    memset(filter, 0, sizeof(ra_filter_t));

    filter->values = (int *)malloc(sample_size * sizeof(int));
    if (!filter->values)
    {
        return NULL;
    }
    memset(filter->values, 0, sample_size * sizeof(int));

    filter->size = sample_size;
    return filter;
}

#if ARDUHAL_LOG_LEVEL >= ARDUHAL_LOG_LEVEL_INFO
static int ra_filter_run(ra_filter_t *filter, int value)
{
    if (!filter->values)
    {
        return value;
    }
    filter->sum -= filter->values[filter->index];
    filter->values[filter->index] = value;
    filter->sum += filter->values[filter->index];
    filter->index++;
    filter->index = filter->index % filter->size;
    if (filter->count < filter->size)
    {
        filter->count++;
    }
    return filter->sum / filter->count;
}
#endif

#if CONFIG_ESP_FACE_DETECT_ENABLED
#if CONFIG_ESP_FACE_RECOGNITION_ENABLED
static void rgb_print(fb_data_t *fb, uint32_t color, const char *str)
{
    fb_gfx_print(fb, (fb->width - (strlen(str) * 14)) / 2, 10, color, str);
}

